Revit 2015 API
BeamSystemTypeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual BeamSystemTypeSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As BeamSystemTypeSetIterator
Visual C++
public:
virtual BeamSystemTypeSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
BeamSystemTypeSet Class
Autodesk.Revit.DB Namespace